Revit 2027 API
ExportUnit Enumeration
 An enumerated type listing possible target units for CAD Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportUnit
Public Enumeration ExportUnit
public enum class ExportUnit
type ExportUnit
Members
Member name | Value | Description
Centimeter | 4 |  Centimeters as decimal values.
Default | 0 |  Default export unit. Depends on Revit's current units.
Foot | 2 |  Feet and Inches in fractional notation.
Inch | 1 |  Inches in fractional notation.
Meter | 5 |  Meters as decimal values.
Millimeter | 3 |  Millimeters as decimal values.
See Also
Reference
Autodesk.Revit.DB Namespace